---
kind: other
id: Methods.T:Autodesk.Revit.DB.SymbolGeometryId
source: html/aeb2cfb9-dde9-f45f-4fb3-6ca4e971417b.htm
---
# SymbolGeometryId Methods

Returns a string suitable to determine if two instances point to the same piece of geometry managed by the same symbol element.